driver-tests/iepse/StressTest/StockTickerJbi/test/stocktest1/template.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
				  xmlns="PriceProcess_iep">
   <soapenv:Header/>
   <soapenv:Body>
      <StreamInput0_MsgObj>
         <symbol>${symbol.0}</symbol>
         <price>${price.0}</price>
         <time>${time.0}</time>
      </StreamInput0_MsgObj>
   </soapenv:Body>
</soapenv:Envelope>